## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.azure-web-vm will be created
  + resource "azurerm_linux_virtual_machine" "azure-web-vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "tfadmin"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = "azwebserver1"
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "norwayeast"
      + max_bid_price                                          = -1
      + name                                                   = "gitAct-test-web-vm"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "gitAct-test-rg"
      + size                                                   = "Standard_B1s"
      + tags                                                   = {
          + "environment" = "test"
          + "responsible" = "50001"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = "gitAct-test-web-vm-os-disk"
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # azurerm_network_interface.azure-web-nic will be created
  + resource "azurerm_network_interface" "azure-web-nic" {
      + applied_dns_servers         = (known after apply)
      + id                          = (known after apply)
      + internal_domain_name_suffix = (known after apply)
      + location                    = "norwayeast"
      + mac_address                 = (known after apply)
      + name                        = "gitAct-test-web-nic"
      + private_ip_address          = (known after apply)
      + private_ip_addresses        = (known after apply)
      + resource_group_name         = "gitAct-test-rg"
      + tags                        = {
          + "environment" = "test"
          + "responsible" = "50001"
        }
      + virtual_machine_id          = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_network_security_group.azure-web-nsg will be created
  + resource "azurerm_network_security_group" "azure-web-nsg" {
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "gitAct-test-web-nsg"
      + resource_group_name = "gitAct-test-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = "Allow HTTP"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowHTTP"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "Internet"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Allow SSH"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowSSH"
              + priority                                   = 101
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "Internet"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "test"
          + "responsible" = "50001"
        }
    }

  # azurerm_public_ip.azure-web-ip will be created
  + resource "azurerm_public_ip" "azure-web-ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "norwayeast"
      + name                    = "gitAct-test-web-ip"
      + resource_group_name     = "gitAct-test-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "environment" = "test"
          + "responsible" = "50001"
        }
    }

  # azurerm_resource_group.azure-rg will be created
  + resource "azurerm_resource_group" "azure-rg" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "gitAct-test-rg"
    }

  # azurerm_subnet.azure-subnet will be created
  + resource "azurerm_subnet" "azure-subnet" {
      + address_prefixes                              = [
          + "10.2.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "gitAct-test-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "gitAct-test-rg"
      + virtual_network_name                          = "gitAct-test-vnet"
    }

  # azurerm_subnet_network_security_group_association.azure-web-nsg-association will be created
  + resource "azurerm_subnet_network_security_group_association" "azure-web-nsg-association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.azure-vnet will be created
  + resource "azurerm_virtual_network" "azure-vnet" {
      + address_space       = [
          + "10.2.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "gitAct-test-vnet"
      + resource_group_name = "gitAct-test-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "environment" = "test"
          + "responsible" = "50001"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + external-ip-azure-web-server = (known after apply)
```
</details>